weber21w/uzebox-weber/uzem_esp8266/avr8.cpp
	while (!self->exitThreads) {
		int blitFrameBuffer;

		SDL_LockMutex(self->mtxVSync);

		/* Wait for "VSync" */
		SDL_CondWait(self->cVSync, self->mtxVSync);

		SDL_UnlockMutex(self->mtxVSync);

		blitFrameBuffer = self->currentFrameBuffer ^ 1;

		if (self->exitThreads)
			return 0;

		/* Tell CPU it's safe to continue drawing */
		//cVSDone.notify_one();

		/* Unlock surface for blitting */
		if (SDL_MUSTLOCK(self->frameBuffer[blitFrameBuffer]))
			SDL_UnlockSurface(self->frameBuffer[blitFrameBuffer]);

		/* Actually draw the buffer to the screen */
		SDL_BlitSurface( self->frameBuffer[blitFrameBuffer], &rect, self->screen, &rect );

		/* Lock surface to gain pixel access */
		if (SDL_MUSTLOCK(self->frameBuffer[blitFrameBuffer]))
			SDL_LockSurface(self->frameBuffer[blitFrameBuffer]);

		/* Flip screen buffer */
		SDL_Flip(self->screen);

		/* Sync to FPS fps */
		timeDelta = SDL_GetTicks() - previousTime;
		if (timeDelta < 1000 / FPS) {
			SDL_Delay((1000 / FPS) - (timeDelta-1));
		}
		previousTime = SDL_GetTicks();

	}
	return 0;
}
#endif



void avr8::write_io(u8 addr,u8 value)
{
	if (addr == ports::PORTC)
	{
	     pixel = palette[value & DDRC];
	}
	// p106 in 644 manual; 16-bit values are latched
	else if (addr == ports::TCNT1H || addr == ports::ICR1H)
		TEMP = value;
	else if (addr == ports::TCNT1L || addr == ports::ICR1L)
	{
		io[addr] = value;
		io[addr+1] = TEMP;
	}
	else if (addr == ports::PORTD)
	{        
        // write value with respect to DDRD register
        io[addr] = value & DDRD;

        //detect if are enabling the SD CE
     //   if(!SD_ENABLED() && ((value & DDRD)&0x40)){
       // 	SDpath
        //}


/////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////
	//detect if we are holding ESP8266 /RST pin to ground from this WRITE

/*
	if(io[ports::DDRD] & (1<<3)){
			
		if(!(io[ports::PORTD] & (1<<3))){//PA3 is grounded, reset ESP8266
		ESP.curr_rst_pin_state = 0;
	}else{
		ESP.curr_rst_pin_state = 1;
	}

	}
*/

ESP.ResetPinState = (io[ports::DDRD] & (1<<3));	//update reset pin state..strangely I think it is fastest to do here since writes do not occur every cycles but the
									//only time the flag could be modified?

//////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////


    }
///////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////



//////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////

#if GUI    
	else if (addr == ports::PORTB)
	{
        u32 elapsed = cycleCounter - prevPortB;
        prevPortB = cycleCounter;

        //if (scanline_count == -999 && value && elapsed >= 774 - 4 && elapsed <= 774 + 4)
          if (scanline_count == -999 && value && elapsed >= 774 -7 && elapsed <= 774 + 7)
            scanline_count = scanline_top;
        else if (scanline_count != -999 && value) {
            ++scanline_count;
            current_cycle = left_edge;

            current_scanline = (u32*)((u8*)frameBuffer[currentFrameBuffer]->pixels + scanline_count * 2 * screen->pitch + inset);
        /*    if (interlaced)
            {
                if (frameCounter & 1)
                    current_scanline += (screen->pitch>>2);
                next_scanline = current_scanline;
            }
            else*/
                next_scanline = current_scanline + (screen->pitch>>2);

            if (scanline_count == 224) 
            {

                // framelock no longer necessary, audio buffer full takes care of it for us.
                if (frameCounter & 1) {
                    currentFrame++;

                 //   if (visualize)
                   //   draw_memorymap();

                    /* Tell GUI thread to update screen */
                    SDL_LockMutex(mtxVSync);
										currentFrameBuffer ^= 1;
                    SDL_CondSignal(cVSync);
                    SDL_UnlockMutex(mtxVSync);
                }

                SDL_Event event;
                while (singleStep? SDL_WaitEvent(&event) : SDL_PollEvent(&event))
                {
					switch (event.type) {
						case SDL_KEYDOWN:
							handle_key_down(event);
							break;
						case SDL_KEYUP:
							handle_key_up(event);
							break;
						case SDL_JOYBUTTONDOWN:
						case SDL_JOYBUTTONUP:
						case SDL_JOYAXISMOTION:
						case SDL_JOYHATMOTION:
						case SDL_JOYBALLMOTION:
							if (jmap.jstate != JMAP_IDLE)
								map_joysticks(event);
							else
								update_joysticks(event);
							break;
						case SDL_QUIT:
							printf("User abort (closed window).\n");
							shutdown(0);
							break;
					}
                }

                if (pad_mode == SNES_MOUSE) 
                {
                    // http://www.repairfaq.org/REPAIR/F_SNES.html
                    // we always report "low sensitivity"
                    int mouse_dx, mouse_dy;
                    u8 mouse_buttons = SDL_GetRelativeMouseState(&mouse_dx,&mouse_dy);
                    mouse_dx >>= mouse_scale;
                    mouse_dy >>= mouse_scale;
                    // clear high bit so we know it's the mouse
                    buttons[0] = (encode_delta(mouse_dx) << 24)
                        | (encode_delta(mouse_dy) << 16) | 0x7FFF;
                    if (mouse_buttons & SDL_BUTTON_LMASK)
                        buttons[0] &= ~(1<<9);
                    if (mouse_buttons & SDL_BUTTON_RMASK)
                        buttons[0] &= ~(1<<8);
                    // keep mouse centered so it doesn't get stuck on edge of screen.
                    // ...and immediately consume the bogus motion event it generated.
                    if (fullscreen)
                    {
                        SDL_WarpMouse(400,300);
                        SDL_GetRelativeMouseState(&mouse_dx,&mouse_dy);
                    }
                }
                else
                    buttons[0] |= 0xFFFF8000;
                singleStep = nextSingleStep;

                scanline_count = -999;
                ++frameCounter;
            }
        }
    }
	else if (addr == ports::PORTA)
	{
		u8 changed = value ^ io[addr];
		u8 went_low = changed & io[addr];
		// u8 went_hi = changed & value;
		if (went_low == (1<<2))		// LATCH
		{
			for (int i=0; i<2; i++)
			{
				latched_buttons[i] = buttons[i];
				// don't let UP+DOWN register at same time
				if ((latched_buttons[i] & ((1<<PAD_LEFT)|(1<<PAD_RIGHT))) == 0)
					latched_buttons[i] |= (1<<PAD_RIGHT);
				// same for LEFT+RIGHT
				if ((latched_buttons[i] & ((1<<PAD_UP)|(1<<PAD_DOWN))) == 0)
					latched_buttons[i] |= (1<<PAD_DOWN);
				// printf("LATCH latched_buttons = %x\n",latched_buttons);
			}
		}
		else if (went_low == (1<<3))	// CLOCK
		{
			if (new_input_mode)
				PINA = u8((latched_buttons[0] & 1) | ((latched_buttons[1] & 1) << 1));
			latched_buttons[0] >>= 1;
			latched_buttons[1] >>= 1;
			if ((latched_buttons[1] < 0xFFFFF) && !new_input_mode)
			{
				//printf("New input routines detected, switching emulation method.\n");
				new_input_mode = true;
			}
		}
		if (!new_input_mode)
			PINA = u8((latched_buttons[0] & 1) | ((latched_buttons[1] & 1) << 1));

		// printf("(writing %x to PORTA pc = %x) setting PINA to %x\n",value,pc-1,PINA);
		io[addr] = value;
	}
	else if (addr == ports::OCR2A)
	{
		if (enableSound && TCCR2B)
		{
			// raw pcm sample at 15.7khz
			while (audioRing.isFull())
				SDL_Delay(1);
			SDL_LockAudio();
			audioRing.push(value);
			SDL_UnlockAudio();
		}
	}
	//else if (addr == ports::PORTC)
	//{
    //    pixel = palette[value & DDRC];
	//}
#endif	// GUI

