weber21w/uzebox-weber/uzem_esp8266/avr8.cpp
	if (++jmap.jiter == NUM_JOYSTICK_BUTTONS) {
		if (SDL_JoystickNumAxes(joysticks[jmap.jindex].device) == 0) {
			set_jmap_state(JMAP_DONE);
			return;
		} else {
			set_jmap_state(JMAP_MORE_AXES);
		}
	} else if (jmap.jiter == (NUM_JOYSTICK_BUTTONS+2)) {
		set_jmap_state(JMAP_MORE_AXES);
	}
	
	switch (jmap.jiter) {
		case 1: printf("\nPress SELECT..."); break;
		case 2: printf("\nPress A..."); break;
		case 3: printf("\nPress B..."); break;
		case 4: printf("\nPress X..."); break;
		case 5: printf("\nPress Y..."); break;
		case 6: printf("\nPress LShldr..."); break;
		case 7: printf("\nPress RShldr..."); break;
		case 9: printf("\nPress Up on axial input..."); break;
		default: break;
	}
	fflush(stdout);
}

void avr8::update_joysticks(SDL_Event &ev)
{
	u8 axisBits = 0;
	
	if (ev.type == SDL_JOYAXISMOTION) {
		for (int i = 0; i < MAX_JOYSTICK_AXES; ++i) {
			if (joysticks[ev.jaxis.which].axes[i].axis == -1)
				break;
			if (joysticks[ev.jaxis.which].axes[i].axis != ev.jaxis.axis) {
				axisBits |= joysticks[ev.jaxis.which].axes[i].bits;
				continue;
			}
			if (i&1) {
				if (ev.jaxis.value < -JOY_ANALOG_DEADZONE) { // UP
					joysticks[ev.jaxis.which].axes[i].bits |= JOY_DIR_UP;
					joysticks[ev.jaxis.which].axes[i].bits &= ~JOY_DIR_DOWN;
				} else if (ev.jaxis.value > JOY_ANALOG_DEADZONE) { // DOWN
					joysticks[ev.jaxis.which].axes[i].bits |= JOY_DIR_DOWN;
					joysticks[ev.jaxis.which].axes[i].bits &= ~JOY_DIR_UP;
				} else {
					joysticks[ev.jaxis.which].axes[i].bits &= ~(JOY_DIR_UP|JOY_DIR_DOWN);
				}
			} else {
				if (ev.jaxis.value < -JOY_ANALOG_DEADZONE) { // LEFT
					joysticks[ev.jaxis.which].axes[i].bits |= JOY_DIR_LEFT;
					joysticks[ev.jaxis.which].axes[i].bits &= ~JOY_DIR_RIGHT;
				} else if (ev.jaxis.value > JOY_ANALOG_DEADZONE) { // RIGHT
					joysticks[ev.jaxis.which].axes[i].bits |= JOY_DIR_RIGHT;
					joysticks[ev.jaxis.which].axes[i].bits &= ~JOY_DIR_LEFT;
				} else {
					joysticks[ev.jaxis.which].axes[i].bits &= ~(JOY_DIR_LEFT|JOY_DIR_RIGHT);
				}
			}
			axisBits |= joysticks[ev.jaxis.which].axes[i].bits;
		}
	} else if (ev.type == SDL_JOYHATMOTION) {
		joysticks[ev.jhat.which].hats &= ~(0xf<<ev.jhat.hat);
		joysticks[ev.jhat.which].hats |= (ev.jhat.value<<ev.jhat.hat);
	} else if (ev.type == SDL_JOYBUTTONDOWN || ev.type == SDL_JOYBUTTONUP) {
		struct joyButton *j = joysticks[ev.jbutton.which].buttons;
	
		for (int i = 0; i < NUM_JOYSTICK_BUTTONS; ++i, ++j) {
			if (ev.jbutton.button == j->button) {
				if (ev.jbutton.type == SDL_JOYBUTTONUP)
					buttons[ev.jaxis.which] |= (1<<j->bit);
				else
					buttons[ev.jaxis.which] &= ~(1<<j->bit);
				break;
			}
		}
	}
		
	if (ev.type == SDL_JOYAXISMOTION || ev.type == SDL_JOYHATMOTION) {
		for (u32 i = JOY_MASK_UP, bit = PAD_UP; bit; i<<=1) {
			if ((axisBits&i) || (joysticks[ev.jaxis.which].hats&i))
				buttons[ev.jaxis.which] &= ~(1<<bit);
			else
				buttons[ev.jaxis.which] |= (1<<bit);
			if (bit == PAD_UP)
				bit = PAD_RIGHT;
			else if (bit == PAD_RIGHT)
				bit = PAD_DOWN;
			else if (bit == PAD_DOWN)
				bit = PAD_LEFT;
			else
				bit = 0;
		}
	}
	/*
	switch (ev.type) {
		case SDL_JOYAXISMOTION:
			printf("Axis motion on P%i. Axis: %i Value: %i\n", ev.jaxis.which+1, ev.jaxis.axis, ev.jaxis.value);
			break;
		case SDL_JOYBALLMOTION:
			printf("Ball motion on P%i. Ball: %i Xrel: %i Yrel: %i\n", ev.jball.which+1, ev.jball.ball, ev.jball.xrel, ev.jball.yrel);
			break;
		case SDL_JOYHATMOTION:
			printf("Hat motion on P%i. Hat: %i Value: %i\n", ev.jhat.which+1, ev.jhat.hat, ev.jhat.value);
			break;
		case SDL_JOYBUTTONDOWN:
			printf("Button press on P%i. Button: %i\n", ev.jbutton.which+1, ev.jbutton.button);
			break;
		case SDL_JOYBUTTONUP:
			printf("Button release on P%i. Button: %i\n", ev.jbutton.which+1, ev.jbutton.button);
			break;
		default:
			printf("Unknown event. Type: %i\n", ev.user.type);
			break;
	}
	*/
}

void avr8::load_joystick_file(const char* filename)
{
	bool validFile = true;
	FILE* f = fopen(filename,"rb");
	
	if (f) {
		size_t btnsSize = MAX_JOYSTICKS*NUM_JOYSTICK_BUTTONS*sizeof(struct joyButton);
		size_t axesSize = MAX_JOYSTICKS*MAX_JOYSTICK_AXES*sizeof(struct joyAxis);
		fseek(f,0,SEEK_END);
		
		size_t size = ftell(f);
		
		if (size < (btnsSize+axesSize)) {
			validFile = false;
		} else {
			fseek(f,0,SEEK_SET);
			size_t result;
			
			for (int i = 0; i < MAX_JOYSTICKS; ++i) {
				if (!(result = fread(joyButtons[i],NUM_JOYSTICK_BUTTONS*sizeof(struct joyButton),1,f)) || 
						!(result = fread(joysticks[i].axes,MAX_JOYSTICK_AXES*sizeof(struct joyAxis),1,f)))
					validFile = false;
			}
		}
		fclose(f);

		if (!validFile)
			printf("Warning: Invalid Joystick settings file.\n");
	}
}
#endif

/////********************************************
////////*********************************************

inline void avr8::update_uart(int cycles){
static uint32_t totalcycles = 0;
totalcycles += cycles;
//printf("%d\n",totalcycles);
	ESP.ModuleClock += cycles;//synchronize system clocks(volatile)

	//****Emulate transmit timing
	//***************************
	if(ESP.UartTxDelayCycles > cycles){//can't possibly send another byte yet

		ESP.UartTxDelayCycles -= cycles;
		//io[ports::UCSR0A] &= ~(1<<UDRE0);//done whenever a byte is written to io

	}else{// if(ESP.UartTxDelayCycles){//program could send a byte right now
		
		ESP.UartTxDelayCycles = 0;
		io[ports::UCSR0A] |= (1<<UDRE0);//show ready to write done whenever the flag is read

	}

	//Emulate receive timing
	//**********************
	if(ESP.UartRxDelayCycles > cycles){//can't possibly have received a new byte yet, UART circuitry would still be receiving the bits
	
		ESP.UartRxDelayCycles -= cycles;

	}else{
		//***We could receive a byte, see if there is one ready
		
		if(!ESP.TxRequested && ESP.UzeboxRxBufferBytes){//ESP is not currently synchronizing buffers(TxRequested, avoid race) and data is there
			io[ports::UDR0] = ESP.UzeboxRxBuffer[ESP.UzeboxRxBufferPos++];//put the data there
			io[ports::UCSR0A] |= (1<<RXC0);//show data ready
			ESP.UartRxDelayCycles = ESP.UartBaudDelayCycles;//set the delay until we could receive again
			ESP.UzeboxRxBufferBytes--;
			if(!ESP.UzeboxRxBufferBytes){
				ESP.UzeboxRxBufferPos = 0;
			}
		}else{
			ESP.UartRxDelayCycles = 0;//no receive delay until a new byte has overwritten the old one

