weber21w/uzebox-weber/uzem_esp8266/avr8.cpp
			if(!ESP.TxRequested && !ESP.UzeboxRxBufferBytes)
				ESP.TxRequested = 1;//make module sync buffers
		}
	}
	

	//******Enforce system clock synchronization 
	//***************************************************

//	if(!ESP.UzeboxRxBufferBytes){//we have no data from module, and we can now receive more. See if there is some
		ESP.Decoherence += cycles;

		if(ESP.Decoherence >= ESP.DecoherenceLimit){
			while(ESP.Decoherence){//stall emulation until the module thread catches up, otherwise we can get incorrect program behavior

			//	Sleep(0);//yield to another thread?
			}
		//also automatically ensures emulation does not go anywhere far until the module thread is initially setup
		}
//	}
	//******Reset and Clock Timing
	//****************************

	//ESP.ResetPinState = (io[ports::DDRD] & (1<<3));	//update reset pin state//TODO FASTER TO DO IN IO READS??!
/*
	if(ESP.BusyCycles){
		if(ESP.BusyCycles < cycles)
			ESP.BusyCycles = 0;
		else
			ESP.BusyCycles -= cycles;	//update delay counter for synchronized cycle accurate timing on module side
	}
*/
	//******Synchronize Uart buffers between threads and avoid race conditions*******
	//*****************************************************************************

	if(/*!ESP.UartTxDelayCycles && */ESP.UzeboxTxRequested/* && ESP.UzeboxTxBufferPos*/){	//ESP8266 has requested we sync our Tx, it will not read from this buffer until we clear the flag

	//ADDED !ESP.UartTxDelayCycles to if...break anything?!?!?!?!?

//asm volatile("": : :"memory");//memory fence, not needed here?
		uint32_t i,j;

		j = ESP.RxBufferBytes;//!!!!module may have previous data it hasn't used yet, don't over write

		for(i=0;i<ESP.UzeboxTxBufferPos;i++){

			ESP.RxBufferBytes++;
			ESP.RxBuffer[j++] = ESP.UzeboxTxBuffer[i];
	//		if(labs(ESP.BaudDivisor-ESP.UzeboxBaudDivisor) > 1)//screw up UART data if bauds do not match
	//			ESP.UzeboxTxBuffer[i] += UartScrambler[ESP.UartScramblerPos++];
	//		printf("U%c,",ESP.RxBuffer[i]);
		}
		ESP.UzeboxTxBufferPos = 0;//Uzebox Tx buffer is now empty

		//if(i){
			ESP.RxBuffer[j] = '\0';//if we did add a byte, string terminate the module buffer for AT strncmp()
			ESP.RxBufferNewData = 1;//let the module know new data has arrived
		//}
asm volatile("": : :"memory");//memory fence to avoid this flag being set out of order
		ESP.UzeboxTxRequested = 0;//let ESP8266 know we are done and it can report new data, if any
	}



}

void avr8::update_hardware(int cycles)
{
	cycleCounter += cycles;
	
	if (TCCR1B & 7)	//if timer 1 is started
	{
		u16 TCNT1 = TCNT1L | (TCNT1H<<8);
		u16 OCR1A = OCR1AL | (OCR1AH<<8);
		u16 OCR1B = OCR1BL | (OCR1BH<<8);

		if(TCCR1B & WGM12){ //timer in CTC mode: count up to OCRnA then resets to zero

			if (TCNT1 < OCR1B && (TCNT1 + cycles) >= OCR1B){
				if (TIMSK1 & OCIE1B){
					TIFR1|=OCF1B; //CTC match flag interrupt
				}
			}

			if (TCNT1 < OCR1A && TCNT1 + cycles >= OCR1A){
				TCNT1 -= (OCR1A - cycles);
				if (TIMSK1 & OCIE1A){
					TIFR1|=OCF1A; //CTC match flag interrupt
				}
			}else{
				TCNT1 += cycles;
			}

		}else{	//timer in normal mode: counts up to 0xffff then rolls over

			if (TCNT1 > (0xFFFF - cycles)){
				if (TIMSK1 & TOIE1){
					 TIFR1|=TOV1; //overflow interrupt
				}
			}
			TCNT1 += cycles;
		}

		TCNT1L = (u8) TCNT1;
		TCNT1H = (u8) (TCNT1>>8);
	}

    // clock the SPI hardware. 
    if((SPCR & 0x40) && SD_ENABLED()){ // only if SPI is enabled
        //TODO: test for master/slave modes (assume master for now)
        // TODO: factor in clock divider 
        
        if(spiTransfer && (cycles > 0)){
            if(spiClock <= cycles){
                //SPI_DEBUG("SPI transfer complete\n");
                update_spi();
                spiClock = 0;
                spiTransfer = 0;
                SPSR |= 0x80; // set interrupt
            }
            else{
                spiClock -= cycles;
            }
        }
    
        // test for interrupt (enable and interrupt flag for SPI)
        if((SPCR & 0x80) && (SPSR & 0x80)){
            //TODO: verify that SPI is dependent upon the global interrupt flag
            if (BIT(SREG,SREG_I)){
                SPSR ^= 0x80; // clear the interrupt
                trigger_interrupt(SPI_STC); // execute the vector
            }
        }
    }

    //clock the EEPROM hardware
    /*
    1. Wait until EEPE becomes zero.
    2. Wait until SELFPRGEN in SPMCSR becomes zero.
    3. Write new EEPROM address to EEAR (optional).
    4. Write new EEPROM data to EEDR (optional).
    5. Write a logical one to the EEMPE bit while writing a zero to EEPE in EECR.
    6. Within four clock cycles after setting EEMPE, write a logical one to EEPE.
    The EEPROM can not be programmed during a CPU write to the Flash memory.
    */
    // are we attempting to program?
    if(EECR & EEPE){
        //printf("attempting write of EEPROM\n");
        cycleCounter += 4; // writes take four cycles
        int addr = (EEARH << 8) | EEARL;
        if(addr < eepromSize) eeprom[addr] = EEDR;
        EECR ^= (EEMPE | EEPE); // clear program bits
        
        // interrupt?
        //if((EECR & EERIE) && BIT(SREG,SREG_I)){
        //    SPSR ^= 0x80; // clear the interrupt
        //    trigger_interrupt(SPI_STC); // execute the vector
        //}
    }
    // are we attempting to read?
    else if(EECR & EERE){
       // printf("attempting read of EEPROM\n");
        cycleCounter += 1; // ireads take one additonal cycle
        int addr = (EEARH << 8) | EEARL;
        if(addr < eepromSize) EEDR = eeprom[addr];
        EECR ^= EERE; // clear read  bit
        
        // interrupt?
        //if((EECR & EERIE) && BIT(SREG,SREG_I)){
        //    SPSR ^= 0x80; // clear the interrupt
        //    trigger_interrupt(SPI_STC); // execute the vector
        //}
    }

	//process interrupts in order of priority
    if(SREG & (1<<SREG_I)){

		if (TIFR1 & OCF1A){

			TIFR1&= ~OCF1A; //clear CTC match flag
			trigger_interrupt(TIMER1_COMPA);

		}else if (TIFR1 & OCF1B){

