weber21w/uzebox-weber/uzem_esp8266/avr8.cpp
			TIFR1&= ~OCF1B; //clear CTC match flag
			trigger_interrupt(TIMER1_COMPB);

		}else if (TIFR1 & TOV1){

			TIFR1&= ~TOV1; //clear TOV1 flag
			trigger_interrupt(TIMER1_OVF);
		}
	}

//////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////
update_uart(cycles);
//ESP.UzeboxUpdateUart(cycles);
/////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#if GUI && VIDEO_METHOD == 1
	if (scanline_count >= 0 && current_cycle < 1440)
	{
		while (cycles)
		{
			if (current_cycle >= 0 && current_cycle < 1440)
				current_scanline[(current_cycle*7)>>4] =
				next_scanline[(int)(current_cycle*7)>>4] = pixel;
			++current_cycle;
			--cycles;
		}
	}
#endif
}

static u8 dummy_sector[512];

#ifdef SPI_DEBUG
char ascii(unsigned char ch){
    if(ch >= 32 && ch <= 127){
        return ch;
    }
    return '.';
}

#endif

/*
void avr8::update_spi(){

	 switch(spiState){
	    case SPI_IDLE_STATE:
	        if(spiByte == 0xff){
	            SPDR = 0x01; // echo back that we're ready
	            break;
	        }
	        spiCommand = spiByte;
	        SPDR = 0x00;
	        spiState = SPI_ARG_X_HI;
	        break;
	    case SPI_ARG_X_HI:
	        SPI_DEBUG("x hi: %02X\n",spiByte);
	        spiArgXhi = spiByte;
	        SPDR = 0x00;
	        spiState = SPI_ARG_X_LO;
	        break;
	    case SPI_ARG_X_LO:
	        SPI_DEBUG("x lo: %02X\n",spiByte);
	        spiArgXlo = spiByte;
	        SPDR = 0x00;
	        spiState = SPI_ARG_Y_HI;
	        break;
	    case SPI_ARG_Y_HI:
	        SPI_DEBUG("y hi: %02X\n",spiByte);
	        spiArgYhi = spiByte;
	        SPDR = 0x00;
	        spiState = SPI_ARG_Y_LO;
	        break;
	    case SPI_ARG_Y_LO:
	        SPI_DEBUG("y lo: %02X\n",spiByte);
	        spiArgYlo = spiByte;
	        SPDR = 0x00;
	        spiState = SPI_ARG_CRC;
	        break;
	    case SPI_ARG_CRC:
	        SPI_DEBUG("SPI - CMD%d (%02X) X:%04X Y:%04X CRC: %02X\n",spiCommand^0x40,spiCommand,spiArgX,spiArgY,spiByte);

	        // ignore CRC and process commands
			 switch(spiCommand){
				 case 0x40: //CMD0 =  RESET / GO_IDLE_STATE
					 SPDR = 0x00;
					 spiState = SPI_RESPOND_R1;
					 spiResponseBuffer[0] = 0xFF;	//Simulate 1 token delay
					 spiResponseBuffer[1] = 0x01;	//Return Idle state flag
					 spiByteCount = 2;
					 break;

				 case 0x41: //CMD1 =  INIT / SEND_OP_COND
					 SPDR = 0x00;
					 spiState = SPI_RESPOND_SINGLE;
					 spiResponseBuffer[0] = 0x00; // 8-clock wait
					 spiResponseBuffer[1] = 0x00; // no error
					 spiResponsePtr = spiResponseBuffer;
					 spiResponseEnd = spiResponsePtr+2;
					 spiByteCount = 0;
					 break;
				 case 0x51: //CMD17 =  READ_BLOCK
					 SPDR = 0x00;
					 spiState = SPI_RESPOND_SINGLE;
					 spiResponseBuffer[0] = 0x00; // 8-clock wait
					 spiResponseBuffer[1] = 0x00; // no error
					 spiResponseBuffer[2] = 0xFE; // start block
					 spiResponsePtr = spiResponseBuffer;
					 spiResponseEnd = spiResponsePtr+3;
					 SDSeekToOffset(spiArg);
					 spiByteCount = 512;
					 break;
				 case 0x52: //CMD18 =  MULTI_READ_BLOCK
					 SPDR = 0x00;
					 spiState = SPI_RESPOND_MULTI;
					 spiResponseBuffer[0] = 0x00; // 8-clock wait
					 spiResponseBuffer[1] = 0x00; // no error
					 spiResponseBuffer[2] = 0xFE; // start block
					 spiResponsePtr = spiResponseBuffer;
					 spiResponseEnd = spiResponsePtr+3;
					 SDSeekToOffset(spiArg);
					 spiByteCount = 512;
					 break;
				 case 0x58: //CMD24 =  WRITE_BLOCK
					 SPDR = 0x00;
					 spiState = SPI_WRITE_SINGLE;
					 spiResponseBuffer[0] = 0x00; // 8-clock wait
					 spiResponseBuffer[1] = 0x00; // no error
					 spiResponseBuffer[2] = 0xFE; // start block
					 spiResponsePtr = spiResponseBuffer;
					 spiResponseEnd = spiResponsePtr+3;
					 SDSeekToOffset(spiArg);
					 spiByteCount = 512;
					 break;
				 default:
								printf("Unknown SPI command: %d\n", spiCommand);
					 SPDR = 0x00;
					 spiState = SPI_RESPOND_SINGLE;
					 spiResponseBuffer[0] = 0x02; // data accepted
					 spiResponseBuffer[1] = 0x05;  //i illegal command
					 spiResponsePtr = spiResponseBuffer;
					 spiResponseEnd = spiResponsePtr+2;
					 break;
				 }
				 break;

			 case SPI_RESPOND_R1:


				 break;

	 }
}
*/

void avr8::update_spi(){
    // SPI state machine
    //SPI_DEBUG("byte: %02x\n",spiByte);
    //SPI_DEBUG("state: %d\n",spiState);
    switch(spiState){
    case SPI_IDLE_STATE:
        if(spiByte == 0xff){
        	//SPI_DEBUG("Idle->0xff\n");
            SPDR = 0xff; // echo back that we're ready
            break;
        }
        spiCommand = spiByte;
        SPDR = 0x00;
        spiState = SPI_ARG_X_HI;
        break;
    case SPI_ARG_X_HI:
        SPI_DEBUG("x hi: %02X\n",spiByte);
        spiArgXhi = spiByte;
        SPDR = 0x00;
        spiState = SPI_ARG_X_LO;
        break;
    case SPI_ARG_X_LO:
        SPI_DEBUG("x lo: %02X\n",spiByte);
        spiArgXlo = spiByte;
        SPDR = 0x00;
        spiState = SPI_ARG_Y_HI;
        break;
    case SPI_ARG_Y_HI:
        SPI_DEBUG("y hi: %02X\n",spiByte);
        spiArgYhi = spiByte;
        SPDR = 0x00;
        spiState = SPI_ARG_Y_LO;
        break;
    case SPI_ARG_Y_LO:
        SPI_DEBUG("y lo: %02X\n",spiByte);
        spiArgYlo = spiByte;
        SPDR = 0x00;
        spiState = SPI_ARG_CRC;
        break;
    case SPI_ARG_CRC:
        SPI_DEBUG("SPI - CMD%d (%02X) X:%04X Y:%04X CRC: %02X\n",spiCommand^0x40,spiCommand,spiArgX,spiArgY,spiByte);
        // ignore CRC and process commands
        switch(spiCommand){
        case 0x40: //CMD0 =  RESET / GO_IDLE_STATE
            SPDR = 0x00;
            spiState = SPI_RESPOND_SINGLE;
            spiResponseBuffer[0] = 0xff; // 8 clock wait
            spiResponseBuffer[1] = 0x01; // send command response R1->idle flag
            spiResponsePtr = spiResponseBuffer;
            spiResponseEnd = spiResponsePtr+2;
            spiByteCount = 0;
            break;
        case 0x41: //CMD1 =  INIT / SEND_OP_COND
            SPDR = 0x00;
            spiState = SPI_RESPOND_SINGLE;
            spiResponseBuffer[0] = 0x00; // 8-clock wait
            spiResponseBuffer[1] = 0x00; // no error
            spiResponsePtr = spiResponseBuffer;
            spiResponseEnd = spiResponsePtr+2;
            spiByteCount = 0;
            break;

        case 0x48: //CMD8 =  INIT / SEND_IF_COND
            SPDR = 0x00;
            spiState = SPI_RESPOND_SINGLE;
            spiResponseBuffer[0] = 0xff; // 8-clock wait
            spiResponseBuffer[1] = 0x01; // return command response R7
            spiResponseBuffer[2] = 0x00; // return command response R7
            spiResponseBuffer[3] = 0x00; // return command response R7
            spiResponseBuffer[4] = 0x01; // return command response R7 voltage accepted
            spiResponseBuffer[5] = spiArgYlo; // return command response R7 check pattern
            spiResponsePtr = spiResponseBuffer;
            spiResponseEnd = spiResponsePtr+6;
            spiByteCount = 0;
            break;

        case 0x4c: //CMD12 =  STOP_TRANSMISSION
            SPDR = 0x00;
            spiState = SPI_RESPOND_SINGLE;
            spiResponseBuffer[0] = 0x4; // card is in "trans" state
            spiResponseBuffer[1] = 0xff; //ready
            spiResponsePtr = spiResponseBuffer;
            spiResponseEnd = spiResponsePtr+2;
            spiByteCount = 0;
            break;


        case 0x51: //CMD17 =  READ_BLOCK
            SPDR = 0x00;
            spiState = SPI_RESPOND_SINGLE;
            spiResponseBuffer[0] = 0xFF; // 8-clock wait
            spiResponseBuffer[1] = 0x00; // no error
            spiResponseBuffer[2] = 0xFE; // start block
            spiResponsePtr = spiResponseBuffer;
            spiResponseEnd = spiResponsePtr+3;
            SDSeekToOffset(spiArg);
            spiByteCount = 512;
            break;
        case 0x52: //CMD18 =  MULTI_READ_BLOCK
            SPDR = 0x00;
            spiState = SPI_RESPOND_MULTI;
            spiResponseBuffer[0] = 0xFF; // 8-clock wait
            spiResponseBuffer[1] = 0x00; // no error
            spiResponseBuffer[2] = 0xFE; // start block
            spiResponsePtr = spiResponseBuffer;
            spiResponseEnd = spiResponsePtr+3;
            spiCommandDelay=0;
            SDSeekToOffset(spiArg);
            spiByteCount = 0;
            break;   
        case 0x58: //CMD24 =  WRITE_BLOCK
            SPDR = 0x00;
            spiState = SPI_WRITE_SINGLE;
            spiResponseBuffer[0] = 0x00; // 8-clock wait
            spiResponseBuffer[1] = 0x00; // no error
            spiResponseBuffer[2] = 0xFE; // start block
            spiResponsePtr = spiResponseBuffer;
            spiResponseEnd = spiResponsePtr+3;
            SDSeekToOffset(spiArg);
            spiByteCount = 512;
            break;

        case 0x69: //ACMD41 =  SD_SEND_OP_COND  (ACMD<n> is the command sequence of CMD55-CMD<n>)
            SPDR = 0x00;
            spiState = SPI_RESPOND_SINGLE;
            spiResponseBuffer[0] = 0xff; // 8 clock wait
           	spiResponseBuffer[1] = 0x00; // send command response R1->OK
            spiResponsePtr = spiResponseBuffer;
            spiResponseEnd = spiResponsePtr+2;
            spiByteCount = 0;
            break;

        case 0x77: //CMD55 =  APP_CMD  (ACMD<n> is the command sequence of CMD55-CMD<n>)
            SPDR = 0x00;
            spiState = SPI_RESPOND_SINGLE;
            spiResponseBuffer[0] = 0xff; // 8 clock wait
            spiResponseBuffer[1] = 0x01; // send command response R1->idle flag
            spiResponsePtr = spiResponseBuffer;
            spiResponseEnd = spiResponsePtr+2;
            spiByteCount = 0;
            break;


